const shapes = document.querySelector('.shapes')
const blurFilter = document.querySelector('.blurFilter')
const information = [
    {
        title: "Символ №1",
        description: "Вы настоящий экстраверт, любите большие компании и знакомства с новыми людьми. Вы часто оказываетесь в центре " +
            "внимания и ни чуть этого не стесняетесь. Природа наделила вас множеством талантов: ораторское мастерство, дипломатия, чувство юмора, " +
            "умение хорошо писать. Из-за высоких коммуникативных способностей вы нравитесь людям, они сами тянутся к общению. А также " +
            "у вас с легкостью получается заводить романы и очаровывать противоположный пол улыбкой.",
        professions: "Подходящие профессии: журналист, блогер, учитель или коуч, пиарщик, ведущий торжественных мероприятий, аниматор, актер."
    },
    {
        title: "Символ №2",
        description: "Вы человек с сильным характером и несгибаемой волей. Вы ответственно относитесь к делам и обязанностям. " +
            "Стараетесь соблюдать сроки, не любите куда-то опаздывать, а также не терпите, когда кто-то пренебрегает вашим временем " +
            "или вниманием. С самого детства любите прямоту, правдивость. Не идете на поводу у других. Всегда отстаиваете свое мнение. " +
            "Из-за обостренного чувства справедливости можете вступать в споры с другими.",
        professions: "Подходящие профессии: врач, юрист, исследователь, инженер, полицейский, военный."
    },
    {
        title: "Символ №3",
        description: "Вы амбициозный и пробивной человек. Вы никогда не хотели довольствоваться малым. Поэтому и сейчас " +
            "стремитесь сделать жизнь ярче, комфортнее, лучше. Ставите большие цели и смело идете к ним. У вас аналитический " +
            "склад ума и мощная интуиция. Есть предпринимательская жилка. Вы будто чуете, где и какая может быть выгода. А " +
            "также не боитесь конкуренции, потому что на все 100 уверены в своих знаниях, опыте, талантах. Ваша сильная сторона - " +
            "умение красиво выходить из самых сложных ситуаций.",
        professions: "Подходящие профессии: маркетолог, предприниматель, антикризисный менеджер, топ-менеджер, специалист по рекламе."
    },
    {
        title: "Символ №4",
        description: "Вы человек, который всегда находится в движении. Вам нравится перемена мест, адреналин, скорость. " +
            "Развлечения вроде: дом, телевизор, книжка - вам не подходят, потому что это скучно. Подлинный источник радости " +
            "для вас - спорт, соревнования (как физические, так и интеллектуальные), риск, путешествия. Вас сложно предсказать, " +
            "потому что желания могут меняться в зависимости от настроения.",
        professions: "Подходящие профессии: гонщик, альпинист, мастер боевых искусство, каскадер, профессиональный спортсмен."
    },
    {
        title: "Символ №5",
        description: "Вы человек с большим сердцем, заботливый и понимающий друг. Можете прочувствовать переживания других людей. " +
            "С детва хотели помогать бездомным животным и трепетно относились к младшим. Вы умеете находить нужные слова, чтобы " +
            "успокоить человека и дать надежду. Свою миссию в жизни видите в помощи другим, благотворительности, в наставлении на " +
            "путь истинный. А также любите детей. Можете искренне веселиться и дурачиться вместе с ними, ведь у вас всегда юная душа.",
        professions: "Подходящие профессии: воспитатель, педагог, работник гостиничного или ресторанного сервиса, волонтер, медицинский работник, психолог."
    },
    {
        title: "Символ №6",
        description: "Вы человек с математическим складом ума. Любите конкретику, краткость, ясность во всем. Лучше понимаете в " +
            "цифрах, чем в человеческих драмах. Однако с высокой точностью можете просчитывать действиях других людей. В голове " +
            "постоянно держите ворох мыслей, которые не дают уснуть. Ответственно подходите к документам, к важным встречам. Большое " +
            "внимание уделяете образованию. Можно сказать, что учитесь чему-то новому на постоянной основе. Не любите, когда другие " +
            "вмешиваются в ваш распорядок и начинают портить планы. Привязаны к вещам и не любите резких перемен.",
        professions: "Подходящие профессии: ученый, математик, аналитик данных, it-специалист, бухгалтер, редактор, игрок в шахматы."
    }
]

for (let shape of shapes.children) {
    shape.addEventListener("click", () => {
        blurFilter.style.visibility = "visible"
        document.body.insertAdjacentHTML("afterbegin", `
        <div class="information">
            <div class="title">
                <h4>${information[shape.id].title}</h4>
                <i class="fa-regular fa-rectangle-xmark"></i>
            </div>
            <p>${information[shape.id].description}</p>
            <div class="btn-row">
                <button class="description" disabled>Значение</button>
                <button class="professions">Подходящие профессии</button>
            </div>
        </div>`)
        const descriptionBtn = document.querySelector('.description')
        const professionsBtn = document.querySelector('.professions')
        descriptionBtn.addEventListener("click", () => {
            document.querySelector('p').textContent = information[shape.id].description
            descriptionBtn.disabled = true;
            professionsBtn.disabled = false;
        })
        professionsBtn.addEventListener("click", () => {
            document.querySelector('p').textContent = information[shape.id].professions
            professionsBtn.disabled = true;
            descriptionBtn.disabled = false;
        })
        document.querySelector('i').addEventListener("click", () => {
            document.body.removeChild(document.querySelector('.information'))
            blurFilter.style.visibility = "hidden"
        })
    })
}